
// // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! //

// ########################################################################### //
// ########################################################################### //
// ########################################################################### //
// ########################################################################### //

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! //
// Функция вывода текущего времени
const OUT_DATE = document.querySelector(`.out-date`)
let timeStep = setInterval(()=>{
    let dayArr = [ 'Воскресенье', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота'];

    let monthsArr = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"];

    let nowTime = new Date();
    let nowTimeYear = nowTime.getFullYear();
    let nowTimeMonth = nowTime.getMonth();
    let nowTimeDate = nowTime.getDate();
    let nowTimeDay = nowTime.getDay();
    let nowTimeHours = nowTime.getHours();
    if (nowTimeHours < 10) {
        nowTimeHours = `0${nowTimeHours}`;
    }
    let nowTimeMinutes = nowTime.getMinutes();
    if (nowTimeMinutes < 10) {
        nowTimeMinutes = `0${nowTimeMinutes}`;
    }
    let nowTimeSeconds = nowTime.getSeconds();
    if (nowTimeSeconds < 10) {
        nowTimeSeconds = `0${nowTimeSeconds}`;
    }
    
    OUT_DATE.textContent = `${nowTimeYear} ${mdFunc(monthsArr, nowTimeMonth)} ${nowTimeDate} ${mdFunc(dayArr, nowTimeDay)} ${nowTimeHours}:${nowTimeMinutes}:${nowTimeSeconds}`;

}, 1000);
// // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! //

// ########################################################################### //
// ########################################################################### //
// ########################################################################### //
// ########################################################################### //

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! //
// Вывод названия месяца и дня недели вместо чила
function mdFunc(arrStr, whatNumb){
    for (i = 0; i < arrStr.length; i++) {
        if (i === whatNumb) {
            return arrStr[i];
        }
    }
}
// // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! //

// ########################################################################### //
// ########################################################################### //
// ########################################################################### //
// ########################################################################### //

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! //